# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

a = int(input(": "))
print(f'Буква под номером {a} - {chr(a + 96)}')
